Repository: sothyro/masterelf_homepage
Catalog: lib/l10n/app_*.arb
Languages: km, zh

# methodBaZiBody
source: BaZi uses your exact birth date and time to build four pillars—Year, Month, Day, Hour—each with a Heavenly Stem and Earthly Branch (eight characters in total). The chart is calculated in true solar time where applicable. We analyse the Five Elements, strengths and clashes, and life cycles to reveal your potential, favourable directions and timing for key decisions.
km: BaZi ប្រើកាលបរិច្ឆេទ និងពេលកំណើតពិតរបស់អ្នកដើម្បីសាងសង់សសរបួន—ឆ្នាំ ខែ ថ្ងៃ ម៉ោង—រៀងរាល់មានដើមរបស់មេឃ និងសាខាផែនដី (អក្សរប្រាំបីសរុប)។ ក្រាហ្វត្រូវបានគណនាក្នុងពេលវេលាព្រះអាទិត្យពិតដែលអាចអនុវត្តបាន។ យើងវិភាគធាតុប្រាំ ចំណុចខ្លាំង និងការប៉ះទង្គិញ និងវដ្តជីវិតដើម្បីបង្ហាញសក្តានុពល ទិសអំណោយផល និងពេលវេលាសម្រាប់ការសម្រេចចិត្តសំខាន់របស់អ្នក។
zh: 八字以出生年月日时排出年、月、日、时四柱，每柱一天干一地支，共八字。在适用处以真太阳时推算。我们分析五行、强弱与冲克及大运流年，以揭示潜能、利方与关键决策的时机。

# methodQimenBody
source: Qimen is built on a 3×3 Nine Palaces grid that changes with date and double-hour. We set the chart for the time of the question or event, place the Three Odd Stars (Yi, Bing, Ding), Eight Gates and Eight Deities, and interpret using Yin or Yang Dun. The formula is time-sensitive and used for strategy, date selection and situational analysis.
km: Qimen សាងសង់លើក្រឡា ៣×៣ ប្រាង្គប្រាំបួនដែលផ្លាស់ប្តូរជាមួយកាលបរិច្ឆេទ និងម៉ោងទ្វេ។ យើងកំណត់ក្រាហ្វសម្រាប់ពេលវេលាសំណួរ ឬព្រឹត្តិការណ៍ ដាក់ផ្កាយបី Odd (Yi, Bing, Ding) ច្រកប្រាំបួន និងទេវតាប្រាំបួន ហើយបកស្រាយដោយប្រើ Yin ឬ Yang Dun។ រូបមន្តរស្មីពេលវេលា និងប្រើសម្រាប់យុទ្ធសាស្រ្ត ការជ្រើសរើសកាលបរិច្ឆេទ និងការវិភាគស្ថានភាព។
zh: 奇门以随日期与时辰变化的九宫格为基础。我们按问事或事件时间起盘，排布三奇、八门与八神，按阴遁或阳遁解读。公式具时效性，用于策略、择日与情境分析。

# methodIChingTitle
source: I Ching (Book of Changes)
km: I Ching (សៀវភៅការផ្លាស់ប្តូរ)
zh: 易经

# methodIChingBody
source: The I Ching is consulted to obtain a hexagram (six lines) that reflects the situation. We use the classical three-coin or yarrow-stalk method: each line is built from bottom to top (6 = transforming yin, 7 = stable yang, 8 = stable yin, 9 = transforming yang). The resulting hexagram and any changing lines are interpreted using the classic text and Master Elf's framework for decisions and direction.
km: I Ching ត្រូវបានពិគ្រោះដើម្បីទទួលហិកសាក្រាម (ប្រាំមួយបន្ទាត់) ដែលឆ្លុះបញ្ចាំងស្ថានភាព។ យើងប្រើវិធីកាក់បី ឬដើម yarrow បុរាណ៖ រៀងរាល់បន្ទាត់ត្រូវបានសាងពីក្រោមឡើងលើ (៦ = yin ផ្លាស់ប្តូរ, ៧ = yang ថ្លៃ, ៨ = yin ថ្លៃ, ៩ = yang ផ្លាស់ប្តូរ)។ ហិកសាក្រាមលទ្ធផល និងបន្ទាត់ផ្លាស់ប្តូរណាមួយត្រូវបានបកស្រាយដោយប្រើអត្ថបទបុរាណ និងគោលការណ៍របស់ Master Elf សម្រាប់ការសម្រេចចិត្ត និងទិសដៅ។
zh: 易经通过占得六爻卦象反映当下。我们采用传统三枚钱币或蓍草法：自下而上建爻（6 老阴、7 少阳、8 少阴、9 老阳）。所得卦象与动爻依经典与 Master Elf 的框架解读，用于决策与方向。

# methodDateSelectionBody
source: Auspicious dates and hours are chosen using the Chinese almanac (Tung Shu), BaZi compatibility with the event and principal, and Qimen Dunjia for strategic timing. We avoid inauspicious days (e.g. conflicting stems and branches) and align with favourable energies for openings, weddings, travel and major commitments.
km: កាលបរិច្ឆេទ និងម៉ោងរុក្ខជាតិត្រូវបានជ្រើសរើសដោយប្រើប្រតិទិនចិន (Tung Shu) ភាពឆបគ្នា BaZi ជាមួយព្រឹត្តិការណ៍ និងអ្នកគ្រប់គ្រង និង Qimen Dunjia សម្រាប់ពេលវេលាយុទ្ធសាស្រ្ត។ យើងជៀសវាងថ្ងៃអាក្រក់ (ឧ. ដើម និងសាខាដែលជម្លោះគ្នា) និងសម្របជាមួយថាមពលអំណោយផលសម្រាប់ការបើក អាពាហ៍ពិពាហ៍ ការធ្វើដំណើរ និងការប្តេជ្ញាសំខាន់។
zh: 吉日吉时依通书、八字与事主之合、以及奇门战略时机选取。我们避开凶日（如干支冲克），并与开业、婚嫁、出行及重大事项的有利能量相合。

# methodFengShuiBody
source: We use Xuan Kong Fei Xing (Flying Star) Feng Shui. The building's period (based on completion year; the Feng Shui year starts 4 February) and facing direction (24 Mountains) determine the Flying Star chart. The nine palaces receive stars that combine with the Lo Shu layout. We assess mountain and water stars, element balance and Period 9 adjustments to recommend placement and remedies.
km: យើងប្រើ Xuan Kong Fei Xing (Flying Star) Feng Shui។ រយៈកាលអាគារ (ផ្អែកលើឆ្នាំបញ្ចប់; ឆ្នាំហ្វងស៊ីចាប់ផ្តើម ៤ កុម្ភៈ) និងទិសដៅមុខ (២៤ ភ្នំ) កំណត់ក្រាហ្វ Flying Star។ ប្រាង្គប្រាំបួនទទួលផ្កាយដែលរួមបញ្ចូលជាមួយប្លង់ Lo Shu។ យើងវាយតម្លៃផ្កាយភ្នំ និងទឹក តុល្យភាពធាតុ និងការកែតម្រូវរយៈកាល ៩ ដើម្បីណែនាំការដាក់ និងថ្នាំបន្ធូរបន្ថយ។
zh: 我们采用玄空飞星风水。以建筑落成年份（风水年自 2 月 4 日起）与坐向（二十四山）定飞星盘。九宫配星与洛书结合。我们审视山星向星、五行平衡与九运调整，以建议布局与化解。

# methodMaoShanBody
source: Mao Shan (Mount Mao) traditions are integrated where appropriate for ritual and practice within Master Elf's system. The methods are applied with respect to classical form and purpose, supporting both spiritual and practical dimensions of Chinese metaphysics as used in his framework.
km: បែបបទ Mao Shan (Mount Mao) ត្រូវបានរួមបញ្ចូលកន្លែងដែលសមរម្យសម្រាប់ពិធីការ និងការអនុវត្តក្នុងប្រព័ន្ធរបស់ Master Elf។ វិធីសាស្រ្តត្រូវបានអនុវត្តដោយគោរពទម្រង់ និងគោលបំណងបុរាណ គាំទ្រទាំងវិមាត្រខាងព្រលឹង និងជាក់ស្តែងនៃរូបវិទ្យាចិនដូចប្រើក្នុងគោលការណ៍របស់គាត់។
zh: 茅山传统在 Master Elf 系统中于适当处融入仪轨与实修。方法依古典形制与用途应用，支持中华玄学在其框架中的精神与实践面向。

# appointmentIntro
source: Choose your consultation type, pick a time, and receive an SMS confirmation to your phone.
km: ជ្រើសរើសប្រភេទការពិគ្រោះរបស់អ្នក ជ្រើសរើសពេលវេលា និងទទួលការបញ្ជាក់ SMS ទៅទូរស័ព្ទរបស់អ្នក។
zh: 选择咨询类型、预约时间，我们将通过短信向您发送确认。

# stepChooseService
source: Selection
km: ការជ្រើសរើស
zh: 选择

# stepDateAndTime
source: Date & time
km: កាលបរិច្ឆេទ និងពេលវេលា
zh: 日期与时间

# stepYourDetails
source: Your details
km: ព័ត៌មានរបស់អ្នក
zh: 您的信息

# stepConfirm
source: Confirm
km: បញ្ជាក់
zh: 确认

source: Your name
km: ឈ្មោះរបស់អ្នក
zh: 您的姓名

# yourPhone
source: Phone number
km: លេខទូរស័ព្ទ
zh: 手机号码

# phoneHint
source: We'll send your confirmation via SMS
km: យើងនឹងផ្ញើការបញ្ជាក់របស់អ្នកតាម SMS
zh: 我们将通过短信发送确认

source: Select date
km: ជ្រើសរើសកាលបរិច្ឆេទ
zh: 选择日期

# selectTime
source: Preferred time
km: ពេលវេលាដែលអ្នកចូលចិត្ត
zh: 首选时间

# confirmAndBook
source: Confirm & book
km: បញ្ជាក់ និងកក់
zh: 确认并预约

# bookingSuccessTitle
source: Booking confirmed
km: បានបញ្ជាក់ការកក់
zh: 预约成功

# bookingSuccessMessage
source: Your consultation has been reserved.
km: ការពិគ្រោះរបស់អ្នកត្រូវបានកក់។
zh: 您的咨询已预留。

# smsConfirmationNote
source: An SMS confirmation has been sent to your phone.
km: ការបញ្ជាក់ SMS ត្រូវបានផ្ញើទៅទូរស័ព្ទរបស់អ្នក។
zh: 短信确认已发送至您的手机。

# smsPoweredByPlasGate
source: SMS confirmation sent via PlasGate.
km: ការបញ្ជាក់ SMS ផ្ញើតាម PlasGate។
zh: 短信确认通过 PlasGate 发送。

# sessionDurationNote
source: Each session is 2 hours with a 1-hour break between sessions.
km: ជាវគ្គ ២ ម៉ោង ចន្លោះ ១ ម៉ោង។
zh: 每次咨询为 2 小时，场次间隔 30 分钟。

source: Session type
km: ប្រភេទសម័យ

# sessionTypeOnline
source: Online
km: អនឡាញ

# sessionTypeVisit
source: Visit
km: មកលេចធ្លោ

source: Book another
km: កក់មួយទៀត
zh: 再预约一次

source: Back
km: ត្រឡប់
zh: 返回

source: View your bookings
km: មើលការកក់របស់អ្នក
zh: 查看您的预约

# viewYourBookingsIntro
source: Enter your phone number to see your upcoming and past bookings.
km: បញ្ចូលលេខទូរស័ព្ទដើម្បីមើលការកក់។
zh: 输入您的手机号码以查看预约记录。

source: Find my bookings
km: រកការកក់របស់ខ្ញុំ
zh: 查找我的预约

# bookingReference
source: Reference
km: លេខយោង
zh: 预约编号

# noBookingsFound
source: No bookings found for this number.
km: រកមិនឃើញការកក់សម្រាប់លេខនេះទេ។
zh: 未找到该号码的预约。

# cancelBookingButton
source: Cancel booking
km: បោះបង់ការកក់
zh: 取消预约

# cancelBookingConfirm
source: Cancel this booking?
km: បោះបង់ការកក់នេះ?
zh: 确定取消此预约？

source: Booking cancelled.
km: បានបោះបង់ការកក់។
zh: 已取消预约。

# loadingSlots
source: Loading available times…
km: កំពុងផ្ទុកពេលវេលា…
zh: 正在加载可选时间…

# statusPending
source: Pending
km: រង់ចាំ
zh: 待确认

# statusConfirmed
source: Confirmed
km: បានបញ្ជាក់
zh: 已确认

# statusCancelled
source: Cancelled
km: បានបោះបង់
zh: 已取消

source: Next
km: បន្ទាប់
zh: 下一步

# smartMoveHeading
source: Every Move Can Be A Smart Move
km: រាល់ជំហានអាចជាជំហានឆ្លាត
zh: 每一步都可以是明智的一步

# smartMoveIntro
source: Behind every breakthrough is a moment of clarity. When you see the full picture, opportunities arise, decisions become easier, and progress flows naturally. That's what we help you with: seeing clearly turns your next step into the right one. A consultation with our team gives you more than insight. It gives you structure to move forward with confidence.
km: ពីក្រោយរាល់ការរីកចម្រើនគឺពេលវេលានៃភាពច្បាស់។ នៅពេលអ្នកឃើញរូបភាពពេញលេញ ឱកាសកើតឡើង ការសម្រេចចិត្តកាន់តែងាយ និងការរីកចម្រើនហូរធម្មជាតិ។ នោះជាអ្វីដែលយើងជួយអ្នក៖ ការឃើញច្បាស់ធ្វើឱ្យជំហានបន្ទាប់របស់អ្នកក្លាយជាត្រឹមត្រូវ។ ការពិគ្រោះជាមួយក្រុមយើងផ្តល់ឱ្យអ្នកច្រើនជាងការយល់ដឹង។ វាផ្តល់ឱ្យអ្នករចនាសម្ព័ន្ធដើម្បីរកមុខដោយជំនឿ។
zh: 每一次突破背后都有清晰的时刻。当你看清全局，机会自然出现，决策更轻松，进展更顺畅。我们正是帮助你做到这一点：看清前路，让下一步成为正确的一步。与我们的团队咨询，你得到的不仅是洞见，更是自信前行的结构。

# smartMoveCard1Title
source: Reach Your Personal Goals
km: ឈានដល់គោលដៅផ្ទាល់ខ្លួនរបស់អ្នក
zh: 达成个人目标

# smartMoveCard1Desc
source: Turn ambitions into achievable milestones with clear guidance.
km: ប្តូរសុបិនរូបទៅជាចំណុចសំខាន់អាចសម្រេចបានដោយការណែនាំច្បាស់។
zh: 在清晰指引下，把抱负化为可实现的里程碑。

# smartMoveCard2Title
source: Create a Roadmap That Fits
km: បង្កើតផែនទីផ្លូរសមនឹង
zh: 制定适合的路线图

# smartMoveCard2Desc
source: Get a structured plan tailored to your life, career, or business.
km: ទទួលផែនការរចនាសម្ព័ន្ធផ្ទាល់ខ្លួនសម្រាប់ជីវិត អាជីវកម្ម ឬអាជីវកម្មអ្នក។
zh: 获得为你的生活、事业或生意量身定制的结构化计划。

# smartMoveCard3Title
source: Remove Hidden Roadblocks
km: យកឧបសគ្គកំបាំងចេញ
zh: 扫除隐藏障碍

# smartMoveCard3Desc
source: Identify obstacles you didn't see and learn how to move past them.
km: កំណត់អត្តសញ្ញាណឧបសគ្គដែលអ្នកមិនបានឃើញ និងរៀនរបៀបឆ្លងវា។
zh: 发现你未曾注意的障碍，并学会跨越它们。

# smartMoveCard4Title
source: Gain Situational Awareness
km: ទទួលភាពយល់ស្ថានភាព
zh: 提升情境认知

# smartMoveCard4Desc
source: See your situation as it is so decisions feel lighter and easier.
km: ឃើញស្ថានភាពរបស់អ្នកដូចជាវាដើម្បីឱ្យការសម្រេចចិត្តស្រាល និងងាយ។
zh: 如实看清现状，让决策更轻松。

# smartMoveCard5Title
source: Unlock Better Options
km: ដោះសោជម្រើសដ៏ល្អប្រសើរ
zh: 发现更好选择

# smartMoveCard5Desc
source: Discover choices you didn't know you had and select the one that serves you best.
km: រកជម្រើសដែលអ្នកមិនដឹងថាអ្នកមាន និងជ្រើសរើសអ្នកដែលជួយអ្នកដ៏ល្អបំផុត។
zh: 发现你未曾意识到的选项，并选出最有利于你的那一个。

# smartMoveCard6Title
source: Move in the Right Direction
km: ផ្លាស់ទីក្នុងទិសដៅត្រឹមត្រូវ
zh: 朝正确方向前进

# smartMoveCard6Desc
source: Act with timing and alignment so progress feels natural and sustainable.
km: ធ្វើសកម្មភាពដោយពេលវេលា និងការសម្របដើម្បីឱ្យការរីកចម្រើនមានភាពធម្មជាតិ និងប្រកបដោយចីរភាព។
zh: 在时机与格局中行动，让进展自然可持续。

# contactLetsConnect
source: Let's Connect!
km: ចូលភ្ជាប់ជាមួយយើង!
zh: 保持联系！

# contactIntro
source: Whether you are seeking clarity through a consultation, exploring our programs, or reaching out for collaborations, our team is here to guide you. Simply choose your subject, leave your message, and we will connect with you shortly.
km: បើអ្នកកំពុងស្វែងរកភាពច្បាស់តាមរយៈការពិគ្រោះ រុករកកម្មវិធីយើង ឬទាក់ទងដើម្បីសហការ ក្រុមយើងនៅទីនេះដើម្បីណែនាំអ្នក។ គ្រាន់តែជ្រើសរើសប្រធានបទ ទុកសារ ហើយយើងនឹងភ្ជាប់ជាមួយអ្នកឆាប់ៗ។
zh: 无论您是想通过咨询获得清晰指引、了解我们的课程，还是寻求合作，我们的团队都会为您提供帮助。只需选择主题、留下留言，我们会尽快与您联系。

# contactFormName
source: Name
km: ឈ្មោះ
zh: 姓名

# contactFormEmail
source: Email
km: អ៉ីមែល
zh: 邮箱

# contactFormPhone
source: Phone
km: ទូរស័ព្ទ
zh: 电话

# contactFormSubject
source: Subject
km: ប្រធានបទ
zh: 主题

# contactFormMessage
source: Message
km: សារ
zh: 留言

# contactSubjectDestiny
source: Destiny / Personal Reading (Bazi)
km: វាសនា / ការអានផ្ទាល់ខ្លួន (Bazi)
zh: 命运 / 个人解读（八字）

# contactSubjectBusiness
source: Business & Strategy Planning (Qi Men / Business Date Selection)
km: ការរៀបចំអាជីវកម្ម និងយុទ្ធសាស្រ្ត (Qi Men / ការជ្រើសរើសកាលបរិច្ឆេទអាជីវកម្ម)
zh: 商业与战略规划（奇门 / 商业择日）

# contactSubjectFengShui
source: Feng Shui (Home / Office Alignment)
km: Feng Shui (ការសម្របផ្ទះ / ការិយាល័យ)
zh: 风水（家居 / 办公布局）

# contactSubjectDateSelection
source: Date Selection (Training Specifics)
km: Date Selection (ព័ត៌មានលម្អិតបណ្តុះបណ្តល់)
zh: 择日（培训相关）

# contactSubjectUnsure
source: Unsure - I need your recommendation
km: មិនច្បាស់ - ខ្ញុំត្រូវការការណែនាំរបស់អ្នក
zh: 不确定 - 需要您的推荐

# forecastAuspiciousStars
source: Auspicious Stars
km: តារាសំណាង
zh: 吉星

# forecastInauspiciousStars
source: Inauspicious Stars
km: តារាគ្រោះ
zh: 凶星

# zodiacRat
source: Rat
km: កណ្តុរ
zh: 鼠

# zodiacOx
source: Ox
km: គោ
zh: 牛

# zodiacTiger
source: Tiger
km: ខ្លា
zh: 虎

# zodiacRabbit
source: Rabbit
km: ទន្សាយ
zh: 兔

# zodiacDragon
source: Dragon
km: នាគ
zh: 龙

# zodiacSnake
source: Snake
km: ពស់
zh: 蛇

# zodiacHorse
source: Horse
km: សេះ
zh: 马

# zodiacGoat
source: Goat
km: ពពែ
zh: 羊

# zodiacMonkey
source: Monkey
km: ស្វ
zh: 猴

# zodiacRooster
source: Rooster
km: មាន់
zh: 鸡

# zodiacDog
source: Dog
km: ឆ្កែ
zh: 狗

# zodiacPig
source: Pig
km: ជ្រូក
zh: 猪

source: Close
km: បិទ

# forecastYearBingWu
source: 2026 Bing Wu, Year of Fire Horse
km: ២០២៦ ប៊ីង អ៊ូ ឆ្នាំសេះភ្លើង

# forecastYearSubtitle
source: 2026: New Beginnings & Transformation
km: ២០២៦៖ ការចាប់ផ្តើមថ្មី និងការផ្លាស់ប្តូរ

# logoPlaceholder
source: Logo {number}
km: ឡូហ្គោ {number}

source: Sample article 1
km: អត្ថបទគំរូ ១

source: Sample article 2
km: អត្ថបទគំរូ ២

source: Sample feature
km: អត្ថបទពិសេសគំរូ

# event1Description
source: The Master Revelation.
km: ការបង្ហាញរបស់ Master។

# event1Location
source: Phnom Penh
km: ភ្នំពេញ

# event2Title
source: Feng Shui & Astrology 2026
km: ហ្វងស៊ី និងហាស្ត្រូឡូហ្គី ២០២៦

# event2Description
source: The Singapore Edition of Feng Shui & Astrology 2026 live event.
km: កម្មវិធីផ្ទាល់របស់ហ្វងស៊ី និងហាស្ត្រូឡូហ្គី ២០២៦ នៅសិង្ហបុរី។

# event3Description
source: The Art of War In The Year of the Fire Horse
km: សិល្បៈសង្គ្រាមក្នុងឆ្នាំសេះភ្លើង

# loginSectionTitle
source: Staff / Admin Login
km: ការចូលប្រើប្រាស់បុគ្គលិក / រដ្ឋាភិបាល

# loginSectionIntro
source: Log in to access the appointment dashboard and manage bookings.
km: ចូលដើម្បីចូលប្រើផ្ទាំងគ្រប់គ្រងការណាត់ជួប និងគ្រប់គ្រងការកក់។

# loginEmail
source: Email
km: អ៉ីមែល

# loginPassword
source: Password
km: លេខសម្ងាត់

# loginButton
source: Log in
km: ចូល

# logoutButton
source: Log out
km: ចាកចេញ

source: Go to Dashboard
km: ទៅផ្ទាំងគ្រប់គ្រង

source: Welcome back
km: សូមស្វាគមន៍មកវិញ

# dashboardTitle
source: Appointment Dashboard
km: ផ្ទាំងគ្រប់គ្រងការណាត់ជួប

# dashboardSubtitle
source: View and manage all bookings
km: មើល និងគ្រប់គ្រងការកក់ទាំងអស់

# dashboardStatsTotal
source: Total
km: សរុប

# dashboardStatsPending
source: Pending
km: រង់ចាំ

# dashboardStatsConfirmed
source: Confirmed
km: បានបញ្ជាក់

# dashboardStatsCancelled
source: Cancelled
km: បានបោះបង់

source: Filter by status
km: ច្រោះតាមស្ថានភាព

# statusColumn
source: Status
km: ស្ថានភាព

# filterAll
source: All
km: ទាំងអស់

source: Refresh
km: ធ្វើឱ្យស្រស់

# appointmentName
source: Name
km: ឈ្មោះ

# appointmentPhone
source: Phone
km: ទូរស័ព្ទ

# confirmAppointment
source: Confirm
km: បញ្ជាក់

source: Reschedule
km: កំណត់ពេលវេលាឡើងវិញ

# noAppointments
source: No appointments found.
km: រកមិនឃើញការណាត់ជួបទេ។

source: Loading appointments…
km: កំពុងផ្ទុកការណាត់ជួប…

# errorLoadingAppointments
source: Failed to load appointments.
km: ផ្ទុកការណាត់ជួបមិនបាន។

source: Status updated.
km: បានធ្វើបច្ចុប្បន្នភាពស្ថានភាព។

# errorUpdatingStatus
source: Failed to update status.
km: ធ្វើបច្ចុប្បន្នភាពស្ថានភាពមិនបាន។

# loginError
source: Invalid email or password.
km: អ៉ីមែល ឬលេខសម្ងាត់មិនត្រឹមត្រូវ។

# loginRequired
source: Please log in to access the dashboard.
km: សូមចូលដើម្បីចូលប្រើផ្ទាំងគ្រប់គ្រង។

# calendarView
source: Calendar
km: ប្រតិទិន

# listView
source: List
km: បញ្ជី

source: Create booking
km: បង្កើតការកក់

# createBookingFor
source: Create booking for client
km: បង្កើតការកក់ជូនអតិថិជន

# selectDateAndTime
source: Select date & time
km: ជ្រើសរើសកាលបរិច្ឆេទ និងពេលវេលា

# bookingCreated
source: Booking created successfully.
km: ការកក់បានបង្កើតដោយជោគជ័យ។

# errorCreatingBooking
source: Failed to create booking.
km: បង្កើតការកក់មិនបាន។

source: Today
km: ថ្ងៃនេះ

source: Available slots
km: ពេលវេលាដែលប្រើបាន

source: Add booking
km: បន្ថែមការកក់

source: Please enter name and phone.
km: សូមបញ្ចូលឈ្មោះ និងទូរស័ព្ទ។

source: Note
km: កំណត់សម្គាល់

# noteHint
source: Optional notes about this booking…
km: កំណត់សម្គាល់ជម្រើសអំពីការកក់នេះ…

# mediaPostsFacebookLink
source: facebook.com/masterelf.vip
zh: facebook.com/masterelf

# academyQiMen
source: QiMen Dunjia Mastery™
zh: 奇门遁甲精修™

# academyBaZi
source: BaZi Harmony™
zh: 八字和谐™

# academyFengShui
source: Feng Shui Charter™
zh: 风水执业™

# academyDateSelection
source: Date Selection™
zh: 择日™

# academyIChing
source: I Ching™
zh: 易经™

# academyMaoShan
source: Mao Shan™
zh: 茅山™

# consult1Method
source: BaZi
zh: 八字

# methodQimenTitle
source: Qimen Dunjia
zh: 奇门遁甲

# methodDateSelectionTitle
source: Date Selection
zh: 择日

# methodFengShuiTitle
source: Feng Shui (Xuan Kong Flying Star)
zh: 风水（玄空飞星）

# methodMaoShanTitle
source: Mao Shan
zh: 茅山
