Repository: sothyro/masterelf_homepage
Catalog: lib/l10n/app_*.arb
Languages: km, zh

source: Skip to content
km: រំលងទៅមាតិកា
zh: 跳到主内容

source: Home
km: ទំព័រដើម
zh: 首页

source: About
km: អំពី
zh: 关于

source: Learning
km: ការរៀន
zh: 学习

source: Chartered Practitioner
km: អ្នកអនុវត្តវិជ្ជាជីវៈផ្លូវការ
zh: 特许执业师

source: Resources
km: ធនធាន
zh: 资源

# appsAndStore
source: Apps & Store
km: កម្មវិធី និងហាង
zh: 应用与商店

source: Master Elf System
km: ប្រព័ន្ធ Master Elf
zh: Master Elf 系统

source: Period 9 Mobile App
km: កម្មវិធីចល័តរយៈកាល ៩
zh: 九运手机应用

source: Talisman Store
km: ហាងវត្ថុមនោគម
zh: 符咒商店

# appsPageTitle
source: Apps & Store
km: កម្មវិធី និងហាង
zh: 应用与商店

# masterElfSystemSpotlightTitle
source: Master Elf System
km: ប្រព័ន្ធ Master Elf
zh: Master Elf 系统

# masterElfSystemSpotlightDesc
source: The complete BaZi and Chinese metaphysics platform. Plot charts, analyse timing and access Master Elf's system online.
km: វេទិកាបាចី និងរូបវិទ្យាចិនពេញលេញ។ គូសក្រាហ្វ វិភាគពេលវេលា និងចូលប្រើប្រព័ន្ធ Master Elf តាមអនឡាញ។
zh: 完整的八字与中华玄学平台。在线排盘、分析时机，使用 Master Elf 系统。

source: Open Master Elf System
km: បើកប្រព័ន្ធ Master Elf
zh: 打开 Master Elf 系统

# period9SpotlightTitle
source: Period 9 Mobile App
km: កម្មវិធីចល័តរយៈកាល ៩
zh: 九运手机应用

# period9SpotlightDesc
source: Carry Period 9 Feng Shui and timing insights in your pocket. Available on iOS and Android.
km: រក្សាទុកចំណេះដឹងហ្វងស៊ី និងពេលវេលារយៈកាល ៩ នៅក្នុងហោប៉ៅអ្នក។ មានលើ iOS និង Android។
zh: 随身掌握九运风水与时机洞见。支持 iOS 与 Android。

# downloadOnAppStore
source: Download on the App Store
km: ទាញយកពី App Store
zh: 在 App Store 下载

source: Get it on Google Play
km: ទាញយកពី Google Play
zh: 在 Google Play 获取

# talismanStoreSpotlightTitle
source: Talisman Store
km: ហាងវត្ថុមនោគម
zh: 符咒商店

# talismanStoreSpotlightDesc
source: Curated talismans and remedies. More items coming soon.
km: វត្ថុមនោគម និងថ្នាំបន្ធូរបន្ថយដែលជ្រើសរើស។ មានវត្ថុបន្ថែមឆាប់ៗនេះ។
zh: 精选符咒与化解用品。更多商品即将上架。

# appsFeatureShowcaseHeading
source: See the system in action
km: មើលប្រព័ន្ធក្នុងការអនុវត្ត
zh: 一览系统功能

# appFeatureQiMen
source: Qi Men Dunjia
km: ឈីមែន ឌុនចា
zh: 奇门遁甲

# appFeatureBaziLife
source: BaZi Life
km: បាចី ជីវិត
zh: 八字人生

# appFeatureBaziReport
source: BaZi Report
km: របាយការណ៍ បាចី
zh: 八字报告

# appFeatureBaziAge
source: BaZi Age
km: បាចី អាយុ
zh: 八字年龄

# appFeatureBaziStars
source: BaZi Stars
km: បាចី ផ្កាយ
zh: 八字星宿

# appFeatureBaziKhmer
source: BaZi Khmer
km: បាចី ខ្មែរ
zh: 八字高棉

# appFeatureBaziChart
source: BaZi Chart
km: ក្រាហ្វ បាចី
zh: 八字命盘

# appFeatureDateSelection
source: Date Selection
km: ការជ្រើសរើសកាលបរិច្ឆេទ
zh: 择日

# appFeatureMarriage
source: Marriage
km: អាពាហ៍ពិពាហ៍
zh: 婚姻

# appFeatureBusinessPartner
source: Business Partner
km: ដៃគូអាជីវកម្ម
zh: 生意伙伴

# appFeatureAdvancedFeatures
source: Advanced Features
km: មុខងារកម្រិតខ្ពស់
zh: 高级功能

# newsAndEvents
source: News & Events
km: ព័ត៌មាន និងព្រឹត្តិការណ៍
zh: 新闻与活动

# mediaAndPosts
source: Media & Posts
km: មេឌៀ និងប្រកាស
zh: 媒体与动态

# mediaPostsFacebookTitle
source: Posts & updates
km: ប្រកាស និងអាប់ដេត
zh: 动态与更新

# mediaPostsFacebookBody
source: Our latest posts, event updates and news are on our Facebook page. Follow us for updates.
km: ប្រកាស អាប់ដេតព្រឹត្តិការណ៍ និងព័ត៌មានចុងក្រោយរបស់យើងនៅលើទំព័រ Facebook។ តាមដានយើងដើម្បីអាប់ដេត។
zh: 我们的最新动态、活动与资讯发布在 Facebook 专页，欢迎关注。

# mediaPostsTelegramTitle
source: Telegram Group
km: ក្រុម Telegram
zh: Telegram 群组

# mediaPostsTelegramBody
source: Join our community on Telegram for discussions and updates.
km: ចូលរួមសហគមន៍របស់យើងនៅ Telegram សម្រាប់ការពិភាក្សា និងអាប់ដេត។
zh: 加入我们的 Telegram 社群，参与讨论并获取更新。

# mediaPostsCoverageTitle
source: Media coverage
km: ការយកព័ត៌មាន
zh: 媒体报道

# mediaPostsCoverageBody
source: Sample links to articles and features (to be updated):
km: តំណភ្ជាប់ឧទាហរណ៍អត្ថបទ និងអត្ថបទពិសេស (នឹងធ្វើអាប់ដេត):
zh: 报道与专题示例链接（将陆续更新）：

source: Consultations
km: ការពិគ្រោះ
zh: 咨询

source: Contact Us
km: ទាក់ទងយើង
zh: 联系我们

source: Book Consultation
km: កក់ការពិគ្រោះ
zh: 预约咨询

source: About Master Elf
km: អំពី Master Elf
zh: 关于 Master Elf

# journey
source: My Endeavour
km: ការខិតខំរបស់ខ្ញុំ
zh: 我的奋进

source: Our Method
km: វិធីសាស្រ្តរបស់យើង
zh: 我们的方法

source: Events
km: ព្រឹត្តិការណ៍
zh: 活动

source: Events Calendar
km: ប្រតិទិនព្រឹត្តិការណ៍
zh: 活动日历

source: Blog
km: ប្លុក
zh: 博客

source: Media
km: មេឌៀ
zh: 媒体报道

source: Quick Links
km: តំណភ្ជាប់រហ័ស
zh: 快速链接

source: Chat with us!
km: ជជែកជាមួយយើង!
zh: 与我们聊天！

# ourSocialMedia
source: Our Social's Media
km: បណ្តាញសង្គមរបស់យើង
zh: 我们的社交媒体

# copyright
source: Copyright © {year} {company}. All rights reserved.
km: រក្សាសិទ្ធិ © {year} {company}។ រក្សាសិទ្ធិទាំងអស់។
zh: 版权所有 © {year} {company}。保留所有权利。

source: Terms of Service
km: លក្ខខណ្ឌសេវាកម្ម
zh: 服务条款

source: Disclaimer
km: ការបដិសេធ
zh: 免责声明

source: Privacy Policy
km: គោលការណ៍ភាពឯកជន
zh: 隐私政策

source: Back to top
km: ត្រលប់ទៅលើ
zh: 回到顶部

# pageNotFoundTitle
source: Page not found
km: រកមិនឃើញទំព័រ
zh: 页面未找到

# pageNotFoundMessage
source: The page you're looking for doesn't exist or has been moved.
km: ទំព័រដែលអ្នកកំពុងរកមិនមាន ឬត្រូវបានផ្លាស់ទី។
zh: 您访问的页面不存在或已移动。

source: Back to Home
km: ត្រលប់ទៅដើម
zh: 返回首页

# heroHeadline1
source: Awareness always comes before outcome.
km: ការយល់ដឹងតែងតែមកមុនលទ្ធផល។
zh: 觉知永远先于结果。

# heroHeadline1Highlight
source: Awareness
km: ការយល់ដឹង
zh: 觉知

# heroHeadline1Suffix
source: always comes before outcome.
km: តែងតែមកមុនលទ្ធផល។
zh: 永远先于结果。

# heroHeadline2Prefix
source: Its true value lies in guiding better
km: តម្លៃពិតរបស់វាគឺការចង្អុលបង្ហាញជម្រើស
zh: 其真正价值在于引导更好的

# heroHeadline2Highlight
source: Choices.
km: ដ៏ល្អប្រសើរ។
zh: 选择。

# heroSubline
source: Feng Shui & Life Planning Services
km: សេវាហ្វងស៊ី និងរៀបចំជីវិត
zh: 风水与人生规划服务

source: Explore All Events
km: ស្វែងរកព្រឹត្តិការណ៍ទាំងអស់
zh: 探索所有活动

source: Coming Up Next
km: រវាងមកដល់
zh: 即将举行

source: All Upcoming Events
km: ព្រឹត្តិការណ៍គ្រប់អនាគត
zh: 所有即将举行的活动

source: Limited seats
km: កៅអីមានដែនកំណត់
zh: 名额有限

source: View Event
km: មើលព្រឹត្តិការណ៍
zh: 查看活动

# exploreCourses
source: Explore
km: ស្វែងរក
zh: 探索

source: Get Consultation
km: ទទួលការពិគ្រោះ
zh: 获取咨询

# finalCtaHeading
source: Hesitate to Start?
km: រងចាំចាប់ផ្តើម?
zh: 犹豫如何开始？

# finalCtaBody
source: Just make a phone call. Send a message to our Facebook page. Or visit us.
km: គ្រាន់តែហៅទូរស័ព្ទ។ ផ្ញើសារទៅទំព័រ Facebook របស់យើង។ ឬមកជួបយើង។
zh: 打个电话即可。给我们的 Facebook 专页发消息。或前来拜访。

source: Not Sure Where To Start?
km: មិនដឹងថាចាប់ផ្តើមពីណា?
zh: 不知从何开始？

# notSureBody
source: We're here to help. Just reach out to us and we'll guide you to your best next step, whether it's a consultation, course or supportive community.
km: យើងនៅទីនេះដើម្បីជួយ។ គ្រាន់តែទាក់ទងយើង ហើយយើងនឹងណែនាំអ្នកដល់ជំហានបន្ទាប់ដ៏ល្អបំផុត វាជាការពិគ្រោះ វគ្គសិក្សា ឬសហគមន៍គាំទ្រ។
zh: 我们随时为您提供帮助。只需联系我们，我们将引导您迈出最佳下一步，无论是咨询、课程还是支持性社群。

source: Language
km: ភាសា
zh: 语言

# sectionExperienceHeading
source: Best practice guided, result Transformation.
km: អនុវត្តដ៏ល្អណែនាំ ការផ្លាស់ប្តូរលទ្ធផល។
zh: 最佳实践引导，成果转化。

# sectionExperienceHeadingPrefix
source: Best practice guided, result
km: អនុវត្តដ៏ល្អណែនាំ
zh: 最佳实践引导，

# sectionExperienceHeadingHighlight
source: Transformation.
km: ការផ្លាស់ប្តូរលទ្ធផល។
zh: 成果转化。

# sectionKnowledgeHeading
source: This isn't just instruction. It's a practical framework for Real Change.
km: វាមិនមែនជាការបង្រៀនធម្មតាទេ។ វាជាគោលការណ៍ជាក់ស្តែងសម្រាប់ការផ្លាស់ប្តូរពិតប្រាកដ។
zh: 这不仅是传授。它是实现真正改变的实践框架。

# sectionKnowledgeBody
source: Over 44,000 followers have used this system. Success is certain when you align with the right people, right places, and right time.
km: មនុស្សច្រើនជាង ៤៤,០០០ នាក់បានប្រើប្រព័ន្ធនេះ។ ជោគជ័យជាក់ច្បាស់នៅពេលអ្នកសម្របខ្លួនជាមួយមនុស្ស កន្លែង និងពេលវេលាត្រឹមត្រូវ។
zh: 超过 44,000 名追随者已使用这一系统。与对的人、对的地方、对的时间同频，成功必然。

# sectionKnowledgeBody2
source: Success doesn't come from working harder. It comes from making the right moves, at the right time, with the right system.
km: ជោគជ័យមិនមកពីធ្វើការលំបាកជាង។ វាមកពីការធ្វើជំហានត្រឹមត្រូវ នៅពេលវេលាត្រឹមត្រូវ ជាមួយប្រព័ន្ធត្រឹមត្រូវ។
zh: 成功不是来自更努力地工作。它来自在正确的时间，用正确的系统，做出正确的行动。

# sectionKnowledgeStat
source: 44,000+ followers
km: មនុស្សច្រើនជាង ៤៤,០០០ នាក់តាមដាន
zh: 44,000+ 追随者

# sectionMapHeading
source: You don't need more advice. You need a RoadMap. Let heaven guide you to the correct way.
km: អ្នកមិនត្រូវការដំបូន្មានបន្ថែមទេ។ អ្នកត្រូវការផែនទីផ្លូវ។ ឱ្យមេឃចង្អុលអ្នកដល់ផ្លូរត្រឹមត្រូវ។
zh: 你不需要更多建议。你需要一张路线图。 让天道指引你走上正途。

# sectionMapIntro
source: On your mark… We know the best way to help you align your timing and create a clear path forward.
km: ត្រៀមរួច… យើងដឹងវិធីដ៏ល្អបំផុតដើម្បីជួយអ្នកសម្របពេលវេលា និងបង្កើតផ្លូរច្បាស់រកមុខ។
zh: 各就各位… 我们深知如何助你对准时机、开辟清晰的前进道路。

# sectionStoryHeading
source: The Story of Master Elf.
km: រឿងរបស់ Master Elf។
zh: Master Elf 的故事。

# sectionStoryPara1
source: Master Elf prepared you for the first 50% of success, then guides you with another 50% to reap the benefit for you.
km: Master Elf រៀបចំអ្នកសម្រាប់ ៥០% ដំបូងនៃជោគជ័យ បន្ទាប់មកណែនាំអ្នកជាមួយ ៥០% ទៀតដើម្បីទទួលប្រយោជន៍ឱ្យអ្នក។
zh: Master Elf 为你铺垫成功的前 50%，再以另外 50% 引领你收获成果。

# sectionStoryPara2
source: Through years of study, testing, and developing a proven method rooted in Chinese Metaphysics.
km: តាមរយៈឆ្នាំនៃការសិក្សា សាកល្បង និងបង្កើតវិធីសាស្រ្តបញ្ជាក់ដែលមានឫសគល់ពីរូបវិទ្យាចិន។
zh: 经年研习、验证与提炼，形成根植于中华玄学的可验证方法。

# sectionStoryPara3
source: Today, that method has helped 44,000 followers create better outcomes for themselves and others.
km: ថ្ងៃនេះ វិធីសាស្រ្តនោះបានជួយមនុស្សច្រើនជាង ៤៤,០០០ នាក់បង្កើតលទ្ធផលល្អប្រសើរសម្រាប់ខ្លួន និងអ្នកដទៃ។
zh: 如今，这套方法已帮助 44,000 多名追随者为己为人创造更好结果。

# sectionStoryCtaButton
source: Master Elf's Endeavor
km: ការខិតខំរបស់ Master Elf
zh: Master Elf 的奋进

# sectionTestimonialsHeading
source: Real Insights. Real Outcomes.
km: ការយល់ដឹងពិត។ លទ្ធផលពិត។
zh: 真实洞见。真实成果。

# sectionTestimonialsSub1
source: They didn't just join the event. They witnessed the real strategy.
km: ពួកគេមិនគ្រាន់តែចូលរួមព្រឹត្តិការណ៍ទេ។ ពួកគេបានឃើញយុទ្ធសាស្រ្តពិត។
zh: 他们不仅是参加了活动。他们见证了真正的策略。

# sectionTestimonialsSub2
source: From business leaders to individuals.
km: ពីអ្នកដឹកនាំអាជីវកម្មដល់បុគ្គល។
zh: 从商界领袖到个人。

source: Featured in
km: បង្ហាញក្នុង
zh: 媒体报道

source: Watch
km: មើល
zh: 观看

# academyQiMenDesc
source: Gain strategic advantage to maximise your wins. Your road to victory!
km: ទទួលបានអត្ថប្រយោជន៍យុទ្ធសាស្រ្តដើម្បីបង្កើនជោគជ័យរបស់អ្នក។
zh: 获得战略优势，最大化你的胜算。

# academyBaZiDesc
source: Reveal your destiny, and understand your hidden power. Maximise your potentials.
km: យល់ពីវាសនារបស់អ្នក និងអំណាចកំបាំង។
zh: 了解你的命运与潜在力量。

# academyFengShuiDesc
source: Chartered Practitioner of the Qi flow. Assign best Feng Shui for your home and office.
km: អ្នកអនុវត្តវិជ្ជាជីវៈនៃលំហូរឈី។
zh: 气的流动之执业师。

# academyPageTitle
source: Learning & Training
km: ការរៀន និងបណ្តុះបណ្តល់
zh: 学习与培训

# academyQiMenAbout
source: Ancient strategy system based on time and space. Used for decision-making, date selection, and situational advantage.
km: ប្រព័ន្ធយុទ្ធសាស្រ្តបុរាណផ្អែកលើពេលវេលា និងទីកន្លែង។ ប្រើសម្រាប់ការសម្រេចចិត្ត ការជ្រើសរើសកាលបរិច្ឆេទ និងអត្ថប្រយោជន៍ស្ថានភាព។
zh: 基于时间与空间的古老策略体系，用于决策、择日与情境优势。

# academyBaZiAbout
source: Your birth chart in Eight Characters. Reveals strengths, life cycles, and hidden potential for career and relationships.
km: ក្រាហ្វកំណើតរបស់អ្នកក្នុងអក្សរប្រាំបី។ បង្ហាញចំណុចខ្លាំង វដ្តជីវិត និងសក្តានុពលកំបាំងសម្រាប់អាជីវកម្ម និងទំនាក់ទំនង។
zh: 八字命盘揭示你的优势、人生阶段与潜能，助力事业与人际。

# academyFengShuiAbout
source: The art of environmental energy. Learn to assess and align spaces for wellbeing and success.
km: សិល្បៈថាមពលបរិស្ថាន។ រៀនវាយតម្លៃ និងសម្របទីធ្លាសម្រាប់សុខុមាលភាព និងជោគជ័យ។
zh: 环境能量之学，学习评估与调整空间，促进福祉与成功。

# academyQiMenTopics
source: Nine Palaces • Strategic timing • Business & personal decisions
km: ប្រាង្គប្រាំបួន • ពេលវេលាយុទ្ធសាស្រ្ត • ការសម្រេចចិត្តអាជីវកម្ម និងផ្ទាល់ខ្លួន
zh: 九宫 • 战略时机 • 商业与个人决策

# academyBaZiTopics
source: Four Pillars • Five Elements • Life potential & cycles
km: សសរបួន • ធាតុប្រាំ • សក្តានុពល និងវដ្តជីវិត
zh: 四柱 • 五行 • 人生潜能与周期

# academyFengShuiTopics
source: Qi flow • Form & Compass • Space alignment
km: លំហូរឈី • ទម្រង់ និងចក្ខុវិស័យ • ការសម្របទីធ្លា
zh: 气流 • 形势与理气 • 空间布局

# academyDateSelectionDesc
source: Choose auspicious timing for key life and business events.
km: ជ្រើសរើសពេលវេលារុក្ខជាតិសម្រាប់ព្រឹត្តិការណ៍ជីវិត និងអាជីវកម្មសំខាន់។
zh: 为人生与事业大事选择吉时。

# academyDateSelectionAbout
source: Select favourable dates and hours using almanac, BaZi and Qimen. Apply to weddings, openings, travel and major decisions.
km: ជ្រើសរើសកាលបរិច្ឆេទ និងម៉ោងអំណោយផលដោយប្រើប្រតិទិន BaZi និង Qimen។ អនុវត្តចំពោះអាពាហ៍ពិពាហ៍ ការបើក ការធ្វើដំណើរ និងការសម្រេចចិត្តសំខាន់។
zh: 结合通书、八字与奇门择取吉日吉时，应用于婚嫁、开业、出行与重大决策。

# academyDateSelectionTopics
source: Tung Shu • Auspicious hours • Events & milestones
km: Tung Shu • ម៉ោងរុក្ខជាតិ • ព្រឹត្តិការណ៍ និងចំណុចសំខាន់
zh: 通书 • 吉时 • 活动与里程碑

# academyIChingDesc
source: Ancient wisdom of the Book of Changes for clarity and direction.
km: បញ្ញាបុរាណនៃសៀវភៅការផ្លាស់ប្តូរសម្រាប់ភាពច្បាស់ និងទិសដៅ។
zh: 古老的变化之书，助你获得清晰与方向。

# academyIChingAbout
source: The 64 hexagrams offer insight into change and outcome. Learn to consult the I Ching for decisions, strategy and personal guidance.
km: ហិកសាក្រាម ៦៤ ផ្តល់ការយល់ដឹងអំពីការផ្លាស់ប្តូរ និងលទ្ធផល។ រៀនពិគ្រោះ I Ching សម្រាប់ការសម្រេចចិត្ត យុទ្ធសាស្រ្ត និងការណែនាំផ្ទាល់ខ្លួន។
zh: 六十四卦揭示变化与结果。学习以易经占问决策、策略与个人指引。

# academyIChingTopics
source: 64 Hexagrams • Divination • Change & strategy
km: ហិកសាក្រាម ៦៤ • ការទស្សន៍ទាយ • ការផ្លាស់ប្តូរ និងយុទ្ធសាស្រ្ត
zh: 六十四卦 • 占卜 • 变化与策略

# academyMaoShanDesc
source: Taoist tradition of ritual and practice for transformation.
km: បែបបទតាវនៃពិធីការ និងការអនុវត្តសម្រាប់ការផ្លាស់ប្តូរ។
zh: 道教仪轨与实修传统，助力转化。

# academyMaoShanAbout
source: Mao Shan (Mount Mao) methods and rituals within Chinese metaphysics. Understand foundations and applications for spiritual and practical use.
km: វិធីសាស្រ្ត និងពិធីការ Mao Shan (Mount Mao) ក្នុងរូបវិទ្យាចិន។ យល់គ្រឹះ និងការអនុវត្តសម្រាប់ការប្រើប្រាស់ខាងព្រលឹង និងជាក់ស្តែង។
zh: 茅山法脉在中国玄学中的方法与仪轨。掌握其基础与应用，用于修行与实践。

# academyMaoShanTopics
source: Rituals • Tradition • Practice & application
km: ពិធីការ • បែបបទ • ការអនុវត្ត និងការអនុវត្ត
zh: 仪轨 • 传统 • 实修与应用

# academyMoreCoursesNote
source: More courses and schedules will be announced here. Contact us for early access or custom group sessions.
km: វគ្គសិក្សា និងកាលវិភាគបន្ថែមនឹងប្រកាសនៅទីនេះ។ ទាក់ទងយើងសម្រាប់ការចូលប្រើមុន ឬសម័យក្រុមផ្ទាល់។
zh: 更多课程与排期将在此公布。如需抢先报名或定制团体课程，请联系我们。

# consult1Category
source: Destiny Reveal
km: ការអាន BaZi
zh: 命运揭示

# consult1Question
source: Become who you are born to be…
km: ក្លាយជាអ្នកដែលអ្នកកើតមកជាមួយ…
zh: 成为你与生俱来的自己…

# consult1Desc
source: Reveal your true power within.
km: បង្ហាញអំណាចពិតរបស់អ្នកនៅខាងក្នុង។
zh: 揭示你内在的真正力量。

# consult2Category
source: Special Event Date Selection
km: សេវាកម្ម Feng Shui
zh: 重大事项择日

# consult2Method
source: QiMen DunJia
km: Feng Shui
zh: 奇门遁甲

# consult2Question
source: Strategise your wise move...
km: រៀបចំកន្លែងអ្នក កំណត់ជីវិតអ្នក...
zh: 谋划你的明智一步...

# consult2Desc
source: Defeat your enemy and maximise your benefits.
km: យល់ពីរបៀបប្រើប្រាស់ថាមពលវិជ្ជមាននៃបរិស្ថានអ្នក។
zh: 克敌制胜，最大化你的利益。

# consult3Category
source: Mediation of Space
km: ការជ្រើសរើសកាលបរិច្ឆេទ
zh: 空间调和

# consult3Method
source: Feng Shui
km: Date Selection
zh: 风水

# consult3Question
source: Arrange your place, define your life...
km: ពេលណាជាពេលវេលាល្អបំផុតដើម្បីជ្រើសរើសអ្វីៗដោយឆ្លាត?
zh: 布置你的空间，定义你的人生...

# consult3Desc
source: Understand how to harness the positive energy of your environment.
km: ជ្រើសរើសពេលវេលា និងកាលបរិច្ឆេទរបស់អ្នកដើម្បីលទ្ធផលល្អបំផុត។
zh: 了解如何善用环境的正面能量。

# consult4Category
source: Auspicious Timing
km: QiMen និង I Ching
zh: 吉时择日

# consult4Method
source: Date Selection
km: QiMen & I Ching
zh: 择日

# consult4Question
source: When is the best time to choose things wisely?
km: រៀបចំជំហានដ៏ឆ្លាតរបស់អ្នក...
zh: 何时才是明智选择的最佳时机？

# consult4Desc
source: Select your time and date for the best possible outcome.
km: ឈ្នះសត្រូវ និងបង្កើនប្រយោជន៍របស់អ្នក។
zh: 选择时间与日期，争取最佳结果。

# stickyCtaText
source: Free 12 Animal Forecast
km: ទស្សន៍ទាយសត្វ ១២ ឥតគិតថ្លៃ
zh: 免费十二生肖运势

# popupTitle1
source: Master Elf's
km: របស់ Master Elf
zh: Master Elf

# popupTitle2
source: 12 ZODIACS FORECAST
km: ទស្សន៍ទាយសត្វ ១២
zh: 十二生肖运势

# popupDescription
source: Year of Fire Horse
km: ទទួលទស្សន៍ទាយឆ្នាំ ២០២៦ របស់អ្នក…
zh: 获取您的个人 2026 生肖运势…

source: Read Full Articles
km: អានអត្ថបទពេញ
zh: 阅读全文

# popupFormPrompt
source: Enter Your Details Below and we'll notify you when your sign premieres.
km: បញ្ចូលព័ត៌មានរបស់អ្នកខាងក្រោម ហើយយើងនឹងជូនដំណឹងអ្នកនៅពេលសញ្ញារបស់អ្នកបញ្ចាំង។
zh: 在下方填写信息，我们将在您的生肖发布时通知您。

source: Submit
km: ដាក់ស្នើ
zh: 提交

# eventsCalendarTitle
source: Master Elf's Events Calendar
km: ប្រតិទិនព្រឹត្តិការណ៍របស់ Master Elf
zh: Master Elf 活动日历

# eventsSubline
source: Where discussion turns into real knowledge.
km: កន្លែងដែលការពិភាក្សាក្លាយជាចំណេះដឹងពិត។
zh: 讨论化为真知的地方。

# eventsDescription
source: Experience the best event for Feng Shui, Chinese Metaphysics and Astrology in Cambodia—live teachings, expert insights, and a community ready to grow with you.
km: ជួបបទពិសោធហ្វងស៊ី រូបវិទ្យាចិន និងហាស្ត្រូឡូហ្គីដ៏ល្អបំផុតនៅកម្ពុជា—ការបង្រៀនផ្ទាល់ ការយល់ដឹងអ្នកជំនាញ និងសហគមន៍ត្រៀមរួចរីកចម្រើនជាមួយអ្នក។
zh: 在柬埔寨，体验顶尖的风水、中华玄学与占星盛会——现场授课、专家解读，与志同道合的伙伴共修共进。

# eventsDescriptionHighlight
source: best event for Feng Shui, Chinese Metaphysics and Astrology in Cambodia
km: ព្រឹត្តិការណ៍ហ្វងស៊ី រូបវិទ្យាចិន និងហាស្ត្រូឡូហ្គីដ៏ល្អបំផុតនៅកម្ពុជា
zh: 顶尖的风水、中华玄学与占星盛会

# secureYourSeat
source: Book your seat
km: កក់កៅអីរបស់អ្នក
zh: 预订座位

source: Search event…
km: ស្វែងរកព្រឹត្តិការណ៍…
zh: 搜索活动…

# registerForEvent
source: Register
km: ចុះឈ្មោះ
zh: 报名

# eventColumn
source: Event
km: ព្រឹត្តិការណ៍
zh: 活动

# eventRegTitle
source: Event Registration
km: ការចុះឈ្មោះព្រឹត្តិការណ៍
zh: 活动报名

# eventRegFor
source: Registering for
km: ចុះឈ្មោះសម្រាប់
zh: 报名活动

# eventRegName
source: Full name
km: ឈ្មោះពេញ
zh: 姓名

# eventRegEmail
source: Email
km: អ៉ីមែល
zh: 邮箱

# eventRegPhone
source: Phone
km: ទូរស័ព្ទ
zh: 电话

# eventRegSubmit
source: Submit registration
km: ដាក់ស្នើការចុះឈ្មោះ
zh: 提交报名

# eventRegSuccess
source: Registration received
km: បានទទួលការចុះឈ្មោះ
zh: 报名已收到

# eventRegSuccessNote
source: We will confirm your seat by email or phone. See you at the event!
km: យើងនឹងបញ្ជាក់កៅអីរបស់អ្នកតាមអ៉ីមែល ឬទូរស័ព្ទ។ ជួបគ្នានៅព្រឹត្តិការណ៍!
zh: 我们将通过邮件或电话确认您的座位。活动现场见！

# noEventsMatch
source: No events match your search.
km: គ្មានព្រឹត្តិការណ៍ផ្គូផ្គងការស្វែងរករបស់អ្នក។
zh: 没有找到匹配的活动。

# dateColumn
source: Date
km: កាលបរិច្ឆេទ
zh: 日期

# locationColumn
source: Location
km: ទីតាំង
zh: 地点

# aboutPageTitle
source: Master Elf | The Rise of Phoenix
km: Master Elf | ការកើនឡើងរបស់ Phoenix
zh: Master Elf | 凤凰崛起

# aboutBreadcrumb
source: About Master Elf.
km: អំពី Master Elf។
zh: 关于 Master Elf。

# aboutHeroHeadline
source: Enrich Lives Through Heavenly Knowledge
km: ធ្វើឱ្យជីវិតសម្បូរតាមចំណេះដឹងមេឃ។
zh: 以天道学识丰富人生

# aboutBullet1
source: It started with believe.
km: វាចាប់ផ្តើមពីជំនឿ។
zh: 始于信念。

# aboutBullet2
source: A mission delegated by the heaven.
km: បេសកកម្មដែលមេឃប្រគល់។
zh: 上天托付的使命。

# aboutBullet3
source: Guiding you with metaphysics into reapable outcome.
km: ណែនាំអ្នកដោយរូបវិទ្យាទៅរកលទ្ធផលអាចទទួលបាន។
zh: 以玄学引领你收获可成之果。

# aboutBullet4
source: Real achievement. Real outputs.
km: ការសម្រេចពិត។ លទ្ធផលពិត។
zh: 真实成就。真实产出。

# journeyPageHeadline
source: My Endeavour
km: ការខិតខំរបស់ខ្ញុំ
zh: 我的奋进

# journeyStory1
source: Master Elf is a recognised practitioner of Feng Shui and Chinese Metaphysics, with a following of over 44,000 and a track record of guiding individuals and businesses toward clarity and results. His path did not begin by chance—it began with a calling.
km: Master Elf គឺជាអ្នកអនុវត្តហ្វងស៊ី និងរូបវិទ្យាចិនដែលទទួលស្គាល់ មានមនុស្សច្រើនជាង ៤៤,០០០ នាក់តាមដាន និងកាតព្វកិច្ចណែនាំបុគ្គល និងអាជីវកម្មឆ្ពោះទៅរកភាពច្បាស់ និងលទ្ធផល។ ផ្លូវរបស់គាត់មិនចាប់ផ្តើមដោយចៃដន្យទេ—វាចាប់ផ្តើមពីការហៅ។
zh: Master Elf 是公认的风水与中华玄学实践者，拥有超过 44,000 名追随者，长期为个人与企业提供清晰指引与成果。他的道路并非偶然，而是始于一份使命。

# journeyStory2
source: What started as a deep belief in the wisdom of the heavens grew into a mission: to bring ancient systems of timing, space and destiny into everyday life. Through years of study, practice and refinement, he built a method that turns metaphysics into actionable insight.
km: អ្វីដែលចាប់ផ្តើមជាជំនឿជ្រាលជ្រៅលើបញ្ញាមេឃ បានក្លាយជាបេសកកម្ម៖ នាំយកប្រព័ន្ធបុរាណនៃពេលវេលា ទីកន្លែង និងវាសនាចូលជីវិតប្រចាំថ្ងៃ។ តាមរយៈឆ្នាំនៃការសិក្សា អនុវត្ត និងកែលម្អ គាត់បានបង្កើតវិធីសាស្រ្តដែលប្តូររូបវិទ្យាទៅជាការយល់ដឹងអាចអនុវត្តបាន។
zh: 对天道智慧的深信，逐渐化为使命：将古老的时机、空间与命运体系带入日常生活。经年累月的研究、实践与提炼，他建立起一套将玄学转化为可执行洞见的方法。

# journeyStory3
source: Today, that method helps clients make better decisions, choose auspicious dates, understand their strengths and align their environments. From destiny readings to strategic date selection and Feng Shui audits, Master Elf's system is designed for real-world impact.
km: ថ្ងៃនេះ វិធីសាស្រ្តនោះជួយអតិថិជនសម្រេចចិត្តល្អជាង ជ្រើសរើសកាលបរិច្ឆេទរុក្ខជាតិ យល់ចំណុចខ្លាំង និងសម្របបរិស្ថានរបស់ពួកគេ។ ពីការអានវាសនាដល់ការជ្រើសរើសកាលបរិច្ឆេទយុទ្ធសាស្រ្ត និងការត្រវែងហ្វងស៊ី ប្រព័ន្ធរបស់ Master Elf ត្រូវបានរចនាសម្រាប់ផលប៉ះពាល់ពិត។
zh: 如今，这套方法帮助客户做出更好决策、择吉日、认识自身优势并调整环境。从命运解读、战略择日到风水勘察，Master Elf 的系统旨在产生真实影响。

# journeyPeriod9Title
source: Period 9 and the New Era
km: រយៈកាល ៩ និងយុគសម័យថ្មី
zh: 九运与新纪元

# journeyPeriod9Body
source: We are now in Period 9 (2024–2043), the Li Fire era in the Xuan Kong Nine Periods cycle. This 20-year phase emphasises fire element energy, the south direction, and themes of visibility, progress and inner clarity. Master Elf's practice is aligned with this shift, helping you navigate the new era with timing and placement that match the cosmic cycle.
km: យើងឥឡូវនៅរយៈកាល ៩ (២០២៤–២០៤៣) យុគភ្លើង Li ក្នុងវដ្តរយៈកាលប្រាំបួន Xuan Kong។ ដំណាក់កាល ២០ ឆ្នាំនេះផ្តោតលើថាមពលធាតុភ្លើង ទិសខាងត្បូង និងចំណុចភាពឃើញ ការរីកចម្រើន និងភាពច្បាស់ខាងក្នុង។ ការអនុវត្តរបស់ Master Elf សម្របជាមួយការផ្លាស់ប្តូរនេះ ជួយអ្នករុករកយុគសម័យថ្មីដោយពេលវេលា និងការដាក់ឱ្យស្របជាមួយវដ្តអាកាស។
zh: 我们正处在九运（2024–2043），即玄空九运中的离火运。这二十年强调火元素能量、南方方位，以及能见度、进步与内在清明。Master Elf 的实践与此转换同步，助你在新纪元中以契合天时的时机与布局前行。

# journeyPhoenixTitle
source: The Rise of the Phoenix
km: ការកើនឡើងរបស់ Phoenix
zh: 凤凰崛起

# journeyPhoenixBody
source: The Rise of the Phoenix is Master Elf's revelation and the name of his system. It symbolises renewal, transformation and the moment when insight leads to action. In Period 9, the phoenix rises—and with the right knowledge, so can you. His framework integrates BaZi, Qimen Dunjia, I Ching, Date Selection, Feng Shui and Mao Shan into one coherent approach for those ready to rise.
km: ការកើនឡើងរបស់ Phoenix គឺជាការបង្ហាញរបស់ Master Elf និងឈ្មោះប្រព័ន្ធរបស់គាត់។ វាសម្គាល់ការធ្វើឱ្យបរិសុទ្ធ ការផ្លាស់ប្តូរ និងពេលវេលាដែលការយល់ដឹងនាំទៅរកសកម្មភាព។ ក្នុងរយៈកាល ៩ ភ្និកស័រកើនឡើង—ហើយជាមួយចំណេះដឹងត្រឹមត្រូវ អ្នកក៏អាចធ្វើបានដែរ។ គោលការណ៍របស់គាត់រួមបញ្ចូល BaZi, Qimen Dunjia, I Ching, Date Selection, Feng Shui និង Mao Shan ជាវិធីសាស្រ្តជាប់លាប់សម្រាប់អ្នកដែលត្រៀមរួចកើនឡើង។
zh: 「凤凰崛起」是 Master Elf 的悟道与系统之名，象征重生、转化，以及洞见化为行动的一刻。在九运中，凤凰崛起——掌握正确知识，你也能腾飞。他的框架将八字、奇门遁甲、易经、择日、风水与茅山融为一体，为准备好的人提供连贯之道。

# methodPageHeadline
source: Our Method
km: វិធីសាស្រ្តរបស់យើង
zh: 我们的方法

# methodIntro
source: Master Elf's system is built on classical Chinese metaphysics. Each discipline is applied with clear formulas and standards so that consultations and training are consistent, explainable and effective. Below is how the main pillars are practiced, calculated and used.
km: ប្រព័ន្ធរបស់ Master Elf សាងសង់លើរូបវិទ្យាចិនបុរាណ។ រៀងរាល់វិជ្ជាជីវៈត្រូវបានអនុវត្តដោយរូបមន្ត និងស្តង់ដារច្បាស់ ដើម្បីឱ្យការពិគ្រោះ និងការបណ្តុះបណ្តល់មានភាពស្របគ្នា អាចពន្យល់បាន និងមានប្រសិទ្ធភាព។ ខាងក្រោមគឺរបៀបដែលសសរសំខាន់ត្រូវបានអនុវត្ត គណនា និងប្រើ។
zh: Master Elf 的系统建立在古典中华玄学之上。每一门学问均以清晰的公式与标准应用，使咨询与教学一致、可解释且有效。以下为主要支柱的实践、推算与运用方式。

# methodBaZiTitle
source: BaZi (Four Pillars of Destiny)
km: BaZi (សសរបួននៃវាសនា)
zh: 八字（四柱命理）
